package org.team3_study.section01.car;

public class Application {

    public static void main(String[] args) {

        /* 필기.
         *  프로그램 개요
         *   카레이서가 자동차를 운전하는 프로그램
         *
         * 필기.
         *  시스템 요구 사항
         *   1. 카레이서는 시동걸기, 엑셀레이터 밟기, 브레이크 밟기, 시동끄기를 할 수 있다.
         *   2. 자동차는 시동걸기, 앞으로 가기, 멈추기, 시동끄기를 할 수 있다.
         *   3. 자동차는 처음에 멈춘 상태로 대기하고 있는다.
         *   4. 카레이서는 먼저 자동차에 시동을 건다. 이미 걸려있는 경우 다시 시동을 걸 수 없다.
         *   5. 카레이서가 엑셀레이터를 밟으면 시동이 걸린 상태일 경우 자동차는 시속이 10km/h 증가하며 앞으로 나간다.
         *   6. 자동차가 달리는 중인 경우 브레이크를 밟으면 자동차의 시속은 바로 0km/h 로 떨어지며 멈춘다.
         *   7. 브레이크를 밟을 때 자동차가 달리는 중이 아니면 이미 멈춰있는 상태라고 안내한다.
         *   8. 카레이서가 시동을 끄면 더 이상 자동차는 움직이지 않는다.
         *   9. 자동차가 달리는 중이라면 시동을 끌 수 없다.
         * */

    }
}
